#!python
# -*- coding: utf-8 -*-

#நூல்மரபு

# 1.
# எழுத்து எனப்படுப,
# அகரம் முதல்
# னகர இறுவாய், முப்பஃது' என்ப-
எழுத்து = ['அ', 'ஆ', 'இ', 'ஈ', 'உ', 'ஊ', 'எ', 'ஏ', 'ஐ', 'ஒ', 'ஓ', 'ஔ',
           'க்', 'ங்', 'ச்', 'ஞ்', 'ட்', 'ண்', 'த்', 'ந்', 'ப்', 'ம்', 'ய்', 'ர்', 'ல்', 'வ்', 'ழ்', 'ள்', 'ற்', 'ன்']

# சார்ந்து வரல் மரபின் மூன்று அலங்கடையே.
# 2.
# அவைதாம்,
# குற்றியலிகரம் குற்றியலுகரம்
# ஆய்தம் என்ற
# முப்பாற்புள்ளியும் எழுத்து ஓரன்ன.

குற்றியலுகரம் = ''
குற்றியலிகரம் = ''
எழுத்து_சார்பு = [குற்றியலுகரம், குற்றியலிகரம், 'ஃ']


# 3.
# அ இ உ
# எ ஒ என்னும் அப் பால் ஐந்தும்
# ஓர் அளபு இசைக்கும் குற்றெழுத்து என்ப
குற்றெழுத்து = ['அ', 'இ', 'உ', 'எ', 'ஒ']
குற்றெழுத்து_இசை = 1

நெட்டெழுத்து = ['ஆ', 'ஈ', 'ஊ', 'ஏ', 'ஓ', 'ஔ']
நெட்டெழுத்து_இசை = 2



